{
	"main": {
		"name": "Michael Satumba",
		"occupation": "Software Engineer",
		"description": "",
		"image": "profilepic.jpg",
		"image1": "picture.jpg",
		"bio": "Hello! My name is Michael, and I focus on tutoring in computer science and making web applications for companies. My tutoring services are focused on helping students improve their understanding of computer science subjects and gain practical skills in programming. I received my undergraduate and graduate degrees in Kinesiology from San Francisco State University and also earned a graduate certificate in software engineering. In my spare time, I enjoy practicing Brazilian Jiu-Jitsu and performing stand-up comedy. I am always looking for opportunities to develop my software engineering skills further and connect with others in the field. Please feel free to reach out if you have any questions or just want to chat!",
		"contactmessage": "Get in touch with me to be build something cool!",
		"email": "mjsatumba@gmail.com",
		"phone": "+01 1234567899",
		"address": {
			"street": "123 Developer Lane",
			"city": "Oxnard",
			"state": "California",
			"zip": "W3B D3V"
		},
		"website": "https://mkeport.vercel.app/",
		"resumedownload": "",
		"social": [
			{
				"name": "youtube",
				"url": "https://www.youtube.com/watch?v=9ec59gz3bpU",
				"className": "fa fa-youtube"
			},
			{
				"name": "facebook",
				"url": "https://www.facebook.com/michaelsatumba",
				"className": "fa fa-facebook"
			},
			{
				"name": "linkedin",
				"url": "https://www.linkedin.com/in/michaelsatumba/",
				"className": "fa fa-linkedin"
			},
			{
				"name": "instagram",
				"url": "https://www.instagram.com/michaelsatumba/",
				"className": "fa fa-instagram"
			},
			{
				"name": "github",
				"url": "https://github.com/michaelsatumba",
				"className": "fa fa-github"
			}
		]
	},
	"resume": {
		"skillmessage": "",
		"education": [
			{
				"school": "San Francisco State University",
				"degree": "Graduate Certificate, Software Engineering",
				"degree2": "Master's Degree, Kinesiology",
				"degree3": "Bachelor's Degree, Kinesiology",
				"graduated": "May 2022",
				"graduated2": "May 2020",
				"description": "Minors in Atheltic Coaching & Communication",
				"description1": "Study Abroad: University of Technology, Sydney, Australia",
				"description2": "Study Abroad: City University of Hong Kong"
			}
		],
		"work": [
			{
				"id": 1,
				"company": "Wyzant",
				"title": "Tutor",
				"years": "October 2022 - Present",
				"description": "As a computer science tutor, I have a passion for helping students learn and succeed in their studies. With a strong background in computer science and a deep understanding of the subject matter, I am able to provide personalized and effective tutoring sessions that cater to the specific needs and goals of each student. Whether you are struggling with a particular course or looking to excel in your studies, I am here to help. My approach to tutoring is hands-on and interactive, with a focus on practical applications and real-world examples. I believe that the best way to learn is by doing, and I encourage my students to ask questions and get involved in the learning process. I have experience working with students of all levels, from beginners to advanced learners, and I am skilled at breaking down complex concepts into easy-to-understand explanations. My goal is to help my students not only understand the material, but also develop a love for computer science and a lifelong desire to learn and grow.In addition to my expertise in computer science, I am also a patient and compassionate tutor who is dedicated to helping my students succeed. I look forward to working with you and helping you achieve your academic goals."
			},
			{
				"id": 3,
				"company": "Ventura Comedy Club",
				"title": "Comedy Host",
				"years": "October 2018 - Present",
				"description": "As the host of Ventura Comedy Club, I am responsible for introducing and welcoming comedians to the stage, as well as keeping the show running smoothly and efficiently. With a strong presence and the ability to engage with the audience, I bring a good sense of humor and quick wit to handle any unexpected situations that may arise. In addition to hosting duties, I also have experience in booking comedians, coordinating with venue staff, and promoting the show through social media and other channels. With a background in stand-up comedy and hosting, excellent communication skills, and the ability to think on my feet, I am the ideal candidate for this exciting opportunity. If you are looking for a natural performer with a love for comedy and the ability to keep a crowd entertained, I am the host for you. So, come and join me for a night of laughter and entertainment at Ventura Comedy Club."
			},
			{
				"id": 2,
				"company": "TicketManager",
				"title": "Associate Software Engineer",
				"years": "February 2023 - May 2024",
				"description": "As a Software Engineer at TicketManager, I specialize in the innovative development and meticulous maintenance of the credential product, crucial for access management to events and arenas for esteemed clients like Coca-Cola, Gatorade, Mercedes, PWC, Allianz, FDJ, DHL, SailGP, JustEats, and Asahi. My expertise centers on designing and implementing access badges, utilizing advanced HTML, CSS, and JavaScript skills to ensure they are not only functional and secure but also aesthetically pleasing and user-friendly. In this role, I engage in proactive collaboration with team members, addressing and resolving any challenges that arise with the credential product. This collaborative effort has been instrumental in delivering a seamless experience for high-profile events catered to our clients. My commitment to staying abreast of the latest trends in web development is a testament to my dedication to elevating the quality of our products continually. My role encapsulates not just the technical aspects of web development but also an acute understanding of client needs and expectations, especially when dealing with high-caliber clients. I pride myself on my meticulous attention to detail, my ability to thrive in both team settings and independent projects, and my unwavering commitment to delivering an exceptional user experience for the attendees of our clients' prestigious events. In summary, as a Software Engineer at TicketManager, my responsibilities encompass the design and development of web appliacations and mobile apps. My role is pivotal in ensuring these products meet the high standards of our notable clientele, and I am committed to continuous improvement and excellence in user experience within the dynamic event management industry."
			},
			{
				"id": 4,
				"company": "Wevise",
				"title": "Software Engineer",
				"years": "January 2023 - March 2023",
				"description": "As a Software Engineer at Wevise, I specialize in developing and maintaining API endpoints using RESTful APIs, Node.js, and other server-side technologies. Additionally, I utilize Firebase to ensure that our platform is secure, scalable, and highly available. Working closely with product managers and front-end developers, I write clean and efficient code that meets the needs of our users. I conduct thorough testing to ensure that the API endpoints are functioning correctly and adhere to industry best practices. In addition, I stay up-to-date with the latest web development technologies and trends to ensure that our solutions are of the highest quality. As a Software Engineer at Wevise, I am dedicated to delivering high-quality solutions that meet the needs of our users. I take pride in my ability to work both independently and as part of a team and I am committed to maintaining the high standards that Wevise is known for."
			},
			{
				"id": 5,
				"company": "San Francisco State University",
				"title": "Researcher",
				"years": "August 2020 - May 2022",
				"description": "As a researcher in kinesiology, my primary focus has been on studying the relationship between physical movement and overall health and wellness. In my role, I have had the opportunity to work with a variety of populations and use a range of research methodologies to gather and analyze data. Additionally, I have integrated my software engineering skills in my research position, developing and implementing fitness applications to aid in data collection and analysis. I am passionate about using my knowledge and skills to make a positive impact on the health and wellness of individuals and communities."
			},
			{
				"id": 6,
				"company": "CSC 842 Human-Computer Interaction",
				"title": "Student",
				"years": "February 2022 - May 2022",
				"description": "As a student in CSC 842 Human-Computer Interaction, I have gained a comprehensive understanding of the principles and practices of designing and evaluating user interfaces for a variety of contexts. Through coursework and hands-on projects, I have learned how to conduct user research, design and prototype interfaces, and evaluate the usability and effectiveness of different design solutions. I am proficient in using industry-standard tools and methods for user-centered design, including usability testing, user research, and usability evaluation techniques. In addition, I have a strong understanding of human-computer interaction theories and principles, including the role of cognition, perception, and emotions in user behavior. I am well-equipped to apply these skills in a variety of professional settings, including web and mobile design, software development, and user experience (UX) research and design."
			},
			{
				"id": 7,
				"company": "CSC 780 Application Development for Mobile Devices",
				"title": "Student",
				"years": "February 2022 - May 2022",
				"description": "As a student in CSC 780 Application Development for Mobile Devices, I have gained the skills and knowledge necessary to design and develop high-quality mobile applications using Xcode and Swift for iOS platforms. Through coursework and hands-on projects, I have learned how to design user interfaces, implement and test application functionality, and optimize performance for mobile devices using Swift and Xcode. I am proficient in using these industry-standard tools and frameworks for mobile development, and have a strong understanding of the iOS ecosystem and the unique constraints and opportunities it presents for app development. In addition, I have a strong understanding of mobile development principles, including user experience design and optimization for mobile devices. I am well-equipped to apply these skills in a variety of professional settings, including iOS app development, software engineering, and user experience design."
			},
			{
				"id": 8,
				"company": "CSC 864 Multimedia Systems",
				"title": "Student",
				"years": "February 2022 - May 2022",
				"description": "As a student in CSC 864 Multimedia Systems, I have gained a comprehensive understanding of the principles and practices of designing, implementing, and evaluating multimedia systems. Through coursework and hands-on projects, I have learned how to capture, encode, and transmit multimedia content, as well as how to design and develop interactive multimedia applications. I am proficient in using industry-standard tools and techniques for multimedia processing, including image and video processing, audio processing, and multimedia authoring. In addition, I have a strong understanding of the technical and aesthetic considerations involved in multimedia design, including the use of color, sound, and motion to engage and communicate with users. I am well-equipped to apply these skills in a variety of professional settings, including web and mobile design, multimedia production, and interactive media development."
			},
			{
				"id": 9,
				"company": "CSC 867 Advanced Internet Application Design and Development",
				"title": "Student",
				"years": "August 2021 - December 2021",
				"description": "As a student in CSC 867 Advanced Internet Application Design and Development, I have gained a deep understanding of the principles and practices of designing and developing advanced web applications. Through coursework and hands-on projects, I have learned how to design and implement scalable and secure web applications using a variety of technologies, including modern front-end frameworks, back-end frameworks, and databases. I am proficient in using industry-standard tools and techniques for web development, including agile development methodologies, version control systems, and cloud deployment platforms. In addition, I have a strong understanding of web application design principles, including user experience design, performance optimization, and security best practices. With these skills, I am well-equipped to tackle complex web development challenges and bring innovative web applications to life."
			},
			{
				"id": 10,
				"company": "The Complete 2021 Web Development Bootcamp, Udemy",
				"title": "Student",
				"years": "March 2021 - September 2021",
				"description": "As a graduate of The Complete 2021 Web Development Bootcamp on Udemy, I have gained a comprehensive understanding of the technologies and techniques required to design and develop modern web applications. Through this intensive course, I have learned how to build interactive and responsive web applications using a variety of languages, frameworks, and tools, including HTML, CSS, JavaScript, jQuery, Bootstrap, Node.js, Express, and MongoDB. I am proficient in using industry-standard development methodologies and practices, including agile development, version control, and deployment to cloud platforms. In addition to technical skills, I have also gained a strong understanding of web development best practices, including user experience design, performance optimization, and security considerations. With these skills, I am well-equipped to tackle a wide range of web development projects and bring innovative ideas to life."
			},
			{
				"id": 11,
				"company": "CSC 848 Software Engineering",
				"title": "Student",
				"years": "June 2021 - August 2021",
				"description": "As a student in CSC 848 Software Engineering, I have gained a comprehensive understanding of the principles and practices of designing and developing high-quality software systems. Through coursework and hands-on projects, I have learned how to apply a variety of software development methodologies, including agile, waterfall, and spiral, to create software products that meet customer needs and expectations. I am proficient in using industry-standard tools and techniques for software development, including programming languages, frameworks, and integrated development environments (IDEs). In addition, I have a strong understanding of software engineering principles, including design patterns, testing, and quality assurance. I am well-equipped to apply these skills in a variety of professional settings, including software development, software project management, and software testing."
			},
			{
				"id": 12,
				"company": "CSC 317 Introduction to Web Software Development",
				"title": "Student",
				"years": "June 2021 - August 2021",
				"description": "As a student in CSC 317 Introduction to Web Software Development, I have gained a solid foundation in the principles and practices of designing and developing web applications. Through coursework and hands-on projects, I have learned how to build interactive and responsive web applications using a variety of languages and frameworks, including HTML, CSS, JavaScript, and jQuery. I am proficient in using industry-standard tools and techniques for web development, including version control systems and cloud deployment platforms. In addition, I have a strong understanding of web development best practices, including user experience design and performance optimization. I am well-equipped to apply these skills in a variety of professional settings, including web development, front-end development, and user experience design. "
			}
		],
		"skills": [
			{
				"name": "Coding",
				"level": "40%"
			},
			{
				"name": "Brazilian Jiu-Jitsu",
				"level": "10%"
			},
			{
				"name": "Comedy",
				"level": "30%"
			}
		]
	},
	"portfolio": {
		"threeProjects": [
			{
				"title": "Want to see how many calories you would lose from point a to point b?",
				"category": "",
				"image": "calorieMapWeb.png",
				"url": "https://calorie-map-web.vercel.app/"
			},
			{
				"title": "Are you tired of spending hours applying to jobs online? Introducing WyzantEasyApply - a simple yet practical solution to automate your job application process.",
				"category": "",
				"image": "wyzantEasyApply.png",
				"url": "https://youtu.be/cxvrES7Cpsk"
			},
			{
				"title": "This app is a game schedule tracker that retrieves games based on sport, city, date, and displays the results in a bar and line graph format.",
				"category": "",
				"image": "sportsTicketManager.png",
				"url": "https://sports-ticket-manager.vercel.app/"
			}
		],
		"freelanceProjects": [
			{
				"title": "Want to know The CA Rob?",
				"category": "",
				"image": "TheCARob.png",
				"url": "https://the-ca-rob.vercel.app/"
			},
			{
				"title": "Want to know Julian?",
				"category": "",
				"image": "JuliansPortfolio.png",
				"url": "https://julian-sanchez.vercel.app/"
			},
			{
				"title": "Chris Wheeler's Weight Loss and Training System",
				"category": "",
				"image": "weightlossandtrainingsystembychriswheeler.png",
				"url": "https://weightlossandtrainingsystembychriswheeler.vercel.app/"
			}
		],
		"projects": [
			{
				"title": "Tinder for cats.",
				"category": "",
				"image": "tinCat.png",
				"url": "https://michaelsatumba.github.io/TinCat/"
			},
			{
				"title": "Want to exercise but don't feel motivated to? Novelty is a great motivator. Here is a random exercise generator.",
				"category": "",
				"image": "neomania.png",
				"url": "https://neomania.vercel.app/"
			},
			{
				"title": "Want to know the what workout you should do based on the weather?",
				"category": "",
				"image": "weatherAnyStorm.png",
				"url": "https://weather-any-storm.vercel.app/"
			},
			{
				"title": "Want to know how much to tip?",
				"category": "",
				"image": "Splitter.png",
				"url": "https://tip-calculator-app-main-delta-seven.vercel.app/"
			},
			{
				"title": "Want to see comedy in Ventura Couunty?",
				"category": "",
				"image": "VenturaCountyOpenMics.png",
				"url": "https://ventura-county-open-mics.vercel.app/"
			},
			{
				"title": "Test your memory",
				"category": "",
				"image": "memoryGame.png",
				"url": "https://michaelsatumba.github.io/Memory-Game/"
			},
			{
				"title": "CRUD application to communicate with my family.",
				"category": "",
				"image": "familyFacebook.png",
				"url": "https://family-facebook.vercel.app"
			}
		],
		"schoolProjects": [
			{
				"title": "Want to know which tweets are positive or negative?",
				"category": "",
				"image": "twitterAnalysis.png",
				"url": "https://github.com/michaelsatumba/Twitter-Project"
			},
			{
				"title": "Want to see how many calories you would lose from point a to point b?",
				"category": "",
				"image": "calorieMap.png",
				"url": "https://github.com/michaelsatumba/CalorieMap"
			},
			{
				"title": "Want to see a design of a workout app?",
				"category": "",
				"image": "workoutApp.png",
				"url": "https://workout-app-delta.vercel.app/"
			},
			{
				"title": "Want to workout with other people?",
				"category": "",
				"image": "Lifter.png",
				"url": "https://play.google.com/store/apps/details?id=com.michaelsatumbajr.lifter"
			},
			{
				"title": "Want to play uno?",
				"category": "",
				"image": "Uno.png",
				"url": "https://github.com/michaelsatumba/UNO"
			},
			{
				"title": "Do you need a server?",
				"category": "",
				"image": "webServer.png",
				"url": "https://github.com/michaelsatumba/Web-Server"
			},

			{
				"title": "Want to workout with other people?",
				"category": "",
				"image": "FitHub.png",
				"url": "https://github.com/michaelsatumba/Fit-Hub"
			},
			{
				"title": "Want to see code for a photo sharing app?",
				"category": "",
				"image": "PhotoApp.png",
				"url": "https://www.youtube.com/watch?v=_VmuTgwfs54&t=11s"
			}
		]
	},
	"testimonials": {
		"testimonials": [
			{
				"text": "Michael is a fantastic engineer, always eager to learn and a hard worker. I had the pleasure of working with Michael when he was right out of school. He picked up working on production code in no time, and was quickly one of the top producers. On the personal side, Michael is a joy to work with. He brings a positive energy and curiosity to work everyday, and always seems to have a smile on his face. Can't recommend him enough, I hope I get to work with him again some day.",
				"user": "Stefan Webster"
			},
			{
				"text": "I had the pleasure of working closely with Michael on a challenging project. Their exceptional problem-solving skills and attention to detail were instrumental in its success. I highly recommend Michael for their dedication, professionalism, and ability to deliver results.",
				"user": "Arslan Khan"
			},
			{
				"text": "Michael's knowledge of front-end development goes unmatched in my time as his colleague. His ability to handle any challenge thrown at him, especially when a task was critical, was noticed and appreciated by all including and especially myself. His work ethic and integrity, paired with his hunger for knowledge in the field of software development, makes him a great asset anywhere. Additionally, his presence in office is one of positivity and comradery, and he's always willing to lend a helping hand when necessary.",
				"user": "Jack Semder"
			},
			{
				"text": "For the last 6 months, Michael has been a great asset to me- helping me work through and develop my software engineering skills, while enrolled at the University of Pennsylvania Software and Web Development Program. Michael worked with me on a variety of topics, including JavaScript, advanced CSS, SQL database management, node.JS, and deployment functionality. Michael was a patient and exceptional teacher , displaying a wide range of expertise and know-how. I am very fortunate to have had his expert guidance while working through a variety of projects and assignments. Michael is a phenomenal teacher and an extremely knowledgeable software engineer. I would highly recommend him to anyone who is looking for additional guidance with software engineering/software development skills.",
				"user": "Anthony Furjanic"
			},
			{
				"text": "Michael is such an amazing coder and person. He had helped me in so many ways I couldn’t repay. Please consider Michael as a future tutor or employee!",
				"user": "Brian Leithead"
			},
			{
				"text": "Michael is a very patient and understand. He understands people's struggles and seeks to make coding fun and exciting. He goes above and beyond most tutors and will work tirelessly to make sure you understand the material. He has a great sense of humor and personality. I would say 100% to hire him for tutoring it's worth it !",
				"user": "Giridhar"
			},
			{
				"text": "Michael is my tutor in Swift Playgrounds and R. I find him very pleasant to work with and most importantly patient. He is very mature and very smart. I enjoy having sessions with him. I highly recommend Michael for coding and software engineering.",
				"user": "Kailee"
			},
			{
				"text": "Helpful, approachable and very nice. We worked on trouble shooting some code and establishing a DB connection. Michael was helpful and very friendly. We made some good progress during our session. Thanks!",
				"user": "Elliot"
			},
			{
				"text": "Michael helped me problem solve and walked me through the things I needed to do for my project. He answered all my questions and helped me understand the things I felt confused about. It gave me clarity and confidence in the topics I was struggling with. I’m very grateful.",
				"user": "Patricia"
			},
			{
				"text": "Michael and I worked together on a coding project that involved javaScript, React, Saga, Redux, and SQL. He was able to help me with something I was stuck on for a few days! He took the time to learn what was going on in my code and was persistent in helping me find a solution to my problem. Thanks for all the help!",
				"user": "Daniel"
			},
			{
				"text": "Knowledgeable and patient tutor. Michael is very knowledgeable and is very helpful in teaching JavaScript. He will explain the material in a way that will make sense. I will def request his tutoring services again!",
				"user": "Aldo"
			},
			{
				"text": "Knowledgeable & Patient tutor. Michael is a very kind and patient tutor which makes him really easy to work with. He taught me new concepts in React that I have little knowledge of and was able to break things down in a way for me to understand. Just by working with Michael, it seems he really cares about what he does and wants to share his knowledge with the community. I highly recommend anyone to get help from Michael that is willing to share his knowledge and who is very down to earth to make sure you understand the concept.",
				"user": "Malik"
			},
			{
				"text": "I worked with Michael on an Apache-like web server written in vanilla Java, which served a subset of the HTTP protocols. Michael proved to be an excellent team member and an astute developer. Despite the challenging task, he demonstrated his ability to adapt and make sound decisions. I found Michael to be a hard worker, a professional, and a joy to work with.",
				"user": "Alexander Chau"
			},
			{
				"text": "I am absolutely impressed with Mr. Satumbas work! As a small independent business owner I needed a website that encapsulated my camera and video services. He brought to life what I once could only imagine would be a perfect website for my business. The only thing that surpasses his website building skills is his fun and eager personality that makes it really easy to work with him. With Gratitude, Julian",
				"user": "Julian Sanchez"
			},
			{
				"text": "I first met Michael through LinkedIn when I reached out to him for help with development on one of my projects: STREAMD. During his time working with me he was responsible with developing the frontend of the website using React Native and Firestore as the tech stack. Right away I was impressed with his ability to take initiative and get started on development as soon as he was able to. Within the first few days, he gave me a working prototype of the site. He demonstrated amazing ability to follow instructions but at the same time solve problems on his own when they arose. What impressed me the most about Michael is his drive to work hard. He’s not someone that will sit around and wait to be assigned problems, but instead will take care of them as he come across them. I’m confident that whatever responsibilities Michael is assigned he can get it done.",
				"user": "Jules Labador"
			},
			{
				"text": "I had the pleasure of working with Michael as my personal trainer. He was able to help me develop my health and fitness goals with achievable milestones so I felt motivated by the progress. Michael has a passion to connect with people and provide solutions. His attention to detail and problem-solving skills are a great asset to any company.",
				"user": "Isabel Chou"
			},
			{
				"text": "I had the pleasure of working with Michael on a web application for the CSC648/848 course where his role was of a Frontend developer. Michael is an innovator with good designing skills. He is always receptive to formulating new techniques and approaches and puts all his energy and time to meet the highest standards. In many instances, he proved that he is a team player and never hesitated to provide support when needed.  He would be a trusted colleague and definitely a valuable addition to the team.",
				"user": "Vidhi Mora"
			},
			{
				"text": "Michael is one of the select few I've worked with that has the ability to adapt to any situation. I had the pleasure to work with Michael as his Backend lead for CSC 648/848 course and I would gladly do it again. He absolutely blew our minds when he unveiled the Frontend portion of the web app. His utilization of Frontend tools such as Bootstrap, CSS/HTML, etc is truly impeccable. In addition, his charisma and communication skills along with his Software Engineering skills makes him a valuable team member.",
				"user": "Johnson Nguyen"
			}
		]
	}
}
